// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "亲爱的媳妇儿",  
        "在这特别的日子里",
        "我想为你写下这封情书"
        "纪念你的30岁生日",
        "30岁是一个标志着成熟和智慧的年纪",
        "你的美丽和智慧随着岁月的流逝而愈加闪耀",
        "回首我们一起走过的岁月",
        "有欢笑，有泪水，有争吵",
        "更有无数的甜蜜和温馨",
        "每一个瞬间",
        "都成为了我们生命中最珍贵的回忆",
        "如今",
        "你迎来了30岁",
        "这是一个全新的起点",
        "我期待着我们的未来",
        "期待着与你一起继续创造更多美好的回忆",
        "我们也会一起迎接生活中的每个挑战",
         "相互扶持，共同成长",
        "亲爱的媳妇",
        "我承诺",
        "在未来的日子里"，
       "无论是顺境还是逆境",
       "我都将不离不弃",
       "陪你走过生命中的每一个阶段",
       "愿我们的爱情如同岁月般永恒～"
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "心爱的小可爱": "./imgs/xiaokeai.png",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "A MESSAGE FOR YOU",
    }
};
